# quests = ['ปลูกต้นมะม่วง', 'ล้างปลา', 'เผาถ่าน']
# if 'ล้างปลา' in quests:
#     print('ทำงานเสร็จ')
#----------------------------------------------------
# quests = ['ปลูกต้นมะม่วง', 'ล้างปลา', 'เผาถ่าน']
# max_quests = 5
# if len(quests) < max_quests:
#     quests.append('จับปลาดุก')
#     print(quests)

#----------------------------------------------------
# quests = ['ปลูกต้นมะม่วง', 'ล้างปลา', 'เผาถ่าน']
# for quest in quests:
#     print(quest)

#----------------------------------------------------
quests = ['ปลูกต้นมะม่วง', 'ล้างปลา', 'เผาถ่าน']
for i in range(len(quests)):
    print(str(i + 1) + '. ' + quests[i])

